stbenn/nuttx/arch/arm/src/stm32h5/stm32h5_serial.c
#  ifdef CONFIG_UART7_RS485
  .rs485_dir_gpio = GPIO_UART7_RS485_DIR,
#    if (CONFIG_UART7_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the STM32 UART8 port. */

#ifdef CONFIG_STM32H5_UART8_SERIALDRIVER
static struct stm32h5_serial_s g_uart8priv =
{
  .dev =
    {
#  if CONSOLE_UART == 9
      .isconsole = true,
#  endif
      .recv     =
      {
        .size   = CONFIG_UART8_RXBUFSIZE,
        .buffer = g_uart8rxbuffer,
      },
      .xmit     =
      {
        .size   = CONFIG_UART8_TXBUFSIZE,
        .buffer = g_uart8txbuffer,
      },
#  ifdef CONFIG_UART8_RXDMA
      .ops      = &g_uart_dma_ops,
#  else
      .ops      = &g_uart_ops,
#  endif
      .priv     = &g_uart8priv,
    },

  .islpuart      = false,
  .irq            = STM32H5_IRQ_UART8,
  .parity         = CONFIG_UART8_PARITY,
  .bits           = CONFIG_UART8_BITS,
  .stopbits2      = CONFIG_UART8_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART8_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_UART8_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART8_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_UART8_RTS,
#  endif
  .baud           = CONFIG_UART8_BAUD,
  .apbclock       = STM32_PCLK1_FREQUENCY,
  .usartbase      = STM32_UART8_BASE,
  .tx_gpio        = GPIO_UART8_TX,
  .rx_gpio        = GPIO_UART8_RX,
#  ifdef CONFIG_UART8_RXDMA
  .rxdma_channel = DMAMAP_UART8_RX,
  .rxfifo        = g_uart8rxfifo,
#  endif

#  ifdef CONFIG_UART8_RS485
  .rs485_dir_gpio = GPIO_UART8_RS485_DIR,
#    if (CONFIG_UART8_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the STM32 UART9 port. */

#ifdef CONFIG_STM32H5_UART9_SERIALDRIVER
static struct stm32h5_serial_s g_uart9priv =
{
  .dev =
    {
#  if CONSOLE_UART == 10
      .isconsole = true,
#  endif
      .recv     =
      {
        .size   = CONFIG_UART9_RXBUFSIZE,
        .buffer = g_uart9rxbuffer,
      },
      .xmit     =
      {
        .size   = CONFIG_UART9_TXBUFSIZE,
        .buffer = g_uart9txbuffer,
      },
#  ifdef CONFIG_UART9_RXDMA
      .ops      = &g_uart_dma_ops,
#  else
      .ops      = &g_uart_ops,
#  endif
      .priv     = &g_uart9priv,
    },

  .islpuart      = false,
  .irq            = STM32H5_IRQ_UART9,
  .parity         = CONFIG_UART9_PARITY,
  .bits           = CONFIG_UART9_BITS,
  .stopbits2      = CONFIG_UART9_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART9_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_UART9_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART9_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_UART9_RTS,
#  endif
  .baud           = CONFIG_UART9_BAUD,
  .apbclock       = STM32_PCLK1_FREQUENCY,
  .usartbase      = STM32_UART9_BASE,
  .tx_gpio        = GPIO_UART9_TX,
  .rx_gpio        = GPIO_UART9_RX,
#  ifdef CONFIG_UART9_RXDMA
  .rxdma_channel = DMAMAP_UART9_RX,
  .rxfifo        = g_uart9rxfifo,
#  endif

#  ifdef CONFIG_UART9_RS485
  .rs485_dir_gpio = GPIO_UART9_RS485_DIR,
#    if (CONFIG_UART9_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the STM32 USART10 port. */

#ifdef CONFIG_STM32H5_USART10_SERIALDRIVER
static struct stm32h5_serial_s g_usart10priv =
{
  .dev =
    {
#  if CONSOLE_UART == 11
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_USART10_RXBUFSIZE,
        .buffer  = g_usart10rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_USART10_TXBUFSIZE,
        .buffer  = g_usart10txbuffer,
      },
#  ifdef CONFIG_USART10_RXDMA
      .ops       = &g_uart_dma_ops,
#  else
      .ops       = &g_uart_ops,
#  endif
      .priv      = &g_usart10priv,
    },

  .islpuart      = false,
  .irq           = STM32H5_IRQ_USART10,
  .parity        = CONFIG_USART10_PARITY,
  .bits          = CONFIG_USART10_BITS,
  .stopbits2     = CONFIG_USART10_2STOP,
  .baud          = CONFIG_USART10_BAUD,
  .apbclock      = STM32_PCLK2_FREQUENCY,
  .usartbase     = STM32_USART10_BASE,
  .tx_gpio       = GPIO_USART10_TX,
  .rx_gpio       = GPIO_USART10_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART10_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_USART10_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART10_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_USART10_RTS,
#  endif
#  ifdef CONFIG_USART10_RXDMA
  .rxdma_channel = DMAMAP_USART10_RX,
  .rxfifo        = g_usart10rxfifo,
#  endif

#  ifdef CONFIG_USART10_RS485
  .rs485_dir_gpio = GPIO_USART10_RS485_DIR,
#    if (CONFIG_USART10_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the STM32 USART11 port. */

#ifdef CONFIG_STM32H5_USART11_SERIALDRIVER
static struct stm32h5_serial_s g_usart11priv =
{
  .dev =
    {
#  if CONSOLE_UART == 12
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_USART11_RXBUFSIZE,
        .buffer  = g_usart11rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_USART11_TXBUFSIZE,
        .buffer  = g_usart11txbuffer,
      },
#  ifdef CONFIG_USART11_RXDMA
      .ops       = &g_uart_dma_ops,
#  else
      .ops       = &g_uart_ops,
#  endif
      .priv      = &g_usart11priv,
    },

  .islpuart      = false,
  .irq           = STM32H5_IRQ_USART11,
  .parity        = CONFIG_USART11_PARITY,
  .bits          = CONFIG_USART11_BITS,
  .stopbits2     = CONFIG_USART11_2STOP,
  .baud          = CONFIG_USART11_BAUD,
  .apbclock      = STM32_PCLK2_FREQUENCY,
  .usartbase     = STM32_USART11_BASE,
  .tx_gpio       = GPIO_USART11_TX,
  .rx_gpio       = GPIO_USART11_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART11_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_USART11_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART11_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_USART11_RTS,
#  endif
#  ifdef CONFIG_USART11_RXDMA
  .rxdma_channel = DMAMAP_USART11_RX,
  .rxfifo        = g_usart11rxfifo,
#  endif

#  ifdef CONFIG_USART11_RS485
  .rs485_dir_gpio = GPIO_USART11_RS485_DIR,
#    if (CONFIG_USART11_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the STM32 UART12 port. */

#ifdef CONFIG_STM32H5_UART12_SERIALDRIVER
static struct stm32h5_serial_s g_uart12priv =
{
  .dev =
    {
#  if CONSOLE_UART == 13
      .isconsole = true,
#  endif
      .recv     =
      {
        .size   = CONFIG_UART12_RXBUFSIZE,
        .buffer = g_uart12rxbuffer,
      },
      .xmit     =
      {
        .size   = CONFIG_UART12_TXBUFSIZE,
        .buffer = g_uart12txbuffer,
      },
#  ifdef CONFIG_UART12_RXDMA
      .ops      = &g_uart_dma_ops,
#  else
      .ops      = &g_uart_ops,
#  endif
      .priv     = &g_uart12priv,
    },

  .islpuart      = false,
  .irq            = STM32H5_IRQ_UART12,
  .parity         = CONFIG_UART12_PARITY,
  .bits           = CONFIG_UART12_BITS,
  .stopbits2      = CONFIG_UART12_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART12_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_UART12_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART12_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_UART12_RTS,
#  endif
  .baud           = CONFIG_UART12_BAUD,
  .apbclock       = STM32_PCLK1_FREQUENCY,
  .usartbase      = STM32_UART12_BASE,
  .tx_gpio        = GPIO_UART12_TX,
  .rx_gpio        = GPIO_UART12_RX,
#  ifdef CONFIG_UART12_RXDMA
  .rxdma_channel = DMAMAP_UART12_RX,
  .rxfifo        = g_uart12rxfifo,
#  endif

#  ifdef CONFIG_UART12_RS485
  .rs485_dir_gpio = GPIO_UART12_RS485_DIR,
#    if (CONFIG_UART12_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

