stbenn/nuttx/arch/arm/src/stm32h5/stm32h5_serial.c
/* This table lets us iterate over the configured USARTs */

static struct stm32h5_serial_s * const
  g_uart_devs[STM32H5_NLPUART + STM32H5_NUSART + STM32H5_NUART] =
{
#ifdef CONFIG_STM32H5_LPUART1_SERIALDRIVER
  [0] = &g_lpuart1priv,
#endif
#ifdef CONFIG_STM32H5_USART1_SERIALDRIVER
  [1] = &g_usart1priv,
#endif
#ifdef CONFIG_STM32H5_USART2_SERIALDRIVER
  [2] = &g_usart2priv,
#endif
#ifdef CONFIG_STM32H5_USART3_SERIALDRIVER
  [3] = &g_usart3priv,
#endif
#ifdef CONFIG_STM32H5_UART4_SERIALDRIVER
  [4] = &g_uart4priv,
#endif
#ifdef CONFIG_STM32H5_UART5_SERIALDRIVER
  [5] = &g_uart5priv,
#endif
#ifdef CONFIG_STM32H5_USART6_SERIALDRIVER
  [6] = &g_usart6priv,
#endif
#ifdef CONFIG_STM32H5_UART7_SERIALDRIVER
  [7] = &g_uart7priv,
#endif
#ifdef CONFIG_STM32H5_UART8_SERIALDRIVER
  [8] = &g_uart8priv,
#endif
#ifdef CONFIG_STM32H5_UART9_SERIALDRIVER
  [9] = &g_uart9priv,
#endif
#ifdef CONFIG_STM32H5_USART10_SERIALDRIVER
  [10] = &g_usart10priv,
#endif
#ifdef CONFIG_STM32H5_USART11_SERIALDRIVER
  [11] = &g_usart11priv,
#endif
#ifdef CONFIG_STM32H5_UART12_SERIALDRIVER
  [12] = &g_uart12priv,
#endif
};

#ifdef CONFIG_PM
struct serialpm_s
{
  struct pm_callback_s pm_cb;
  bool serial_suspended;
};

static struct serialpm_s g_serialpm =
{
  .pm_cb.notify  = stm32h5serial_pmnotify,
  .pm_cb.prepare = stm32h5serial_pmprepare,
  .serial_suspended = false
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32h5serial_getreg
 ****************************************************************************/

static inline
uint32_t stm32h5serial_getreg(struct stm32h5_serial_s *priv, int offset)
{
  return getreg32(priv->usartbase + offset);
}

/****************************************************************************
 * Name: stm32h5serial_putreg
 ****************************************************************************/

static inline
void stm32h5serial_putreg(struct stm32h5_serial_s *priv,
                          int offset, uint32_t value)
{
  putreg32(value, priv->usartbase + offset);
}

/****************************************************************************
 * Name: stm32h5serial_setusartint
 ****************************************************************************/

static inline
void stm32h5serial_setusartint(struct stm32h5_serial_s *priv,
                               uint16_t ie)
{
  uint32_t cr;

  /* Save the interrupt mask */

  priv->ie = ie;

  /* And restore the interrupt state (see the interrupt enable/usage table
   * above)
   */

  cr = stm32h5serial_getreg(priv, STM32_USART_CR1_OFFSET);
  cr &= ~(USART_CR1_USED_INTS);
  cr |= (ie & (USART_CR1_USED_INTS));
  stm32h5serial_putreg(priv, STM32_USART_CR1_OFFSET, cr);

  cr = stm32h5serial_getreg(priv, STM32_USART_CR3_OFFSET);
  cr &= ~USART_CR3_EIE;
  cr |= (ie & USART_CR3_EIE);
  stm32h5serial_putreg(priv, STM32_USART_CR3_OFFSET, cr);
}

/****************************************************************************
 * Name: up_restoreusartint
 ****************************************************************************/

static void stm32h5serial_restoreusartint(struct stm32h5_serial_s *priv,
                                          uint16_t ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(NULL);

  stm32h5serial_setusartint(priv, ie);

  spin_unlock_irqrestore(NULL, flags);
}

/****************************************************************************
 * Name: stm32h5serial_disableusartint
 ****************************************************************************/

static void stm32h5serial_disableusartint(struct stm32h5_serial_s *priv,
                                          uint16_t *ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(NULL);

  if (ie)
    {
      uint32_t cr1;
      uint32_t cr3;

      /* USART interrupts:
       *
       * Enable           Status         Meaning                Usage
       * ---------------- -------------- ---------------------- -------------
       * USART_CR1_IDLEIE USART_ISR_IDLE Idle Line Detected     (not used)
       * USART_CR1_RXNEIE USART_ISR_RXNE Received Data Ready to
       *                                 be Read
       * "              " USART_ISR_ORE  Overrun Error Detected
       * USART_CR1_TCIE   USART_ISR_TC   Transmission Complete  (only RS-485)
       * USART_CR1_TXEIE  USART_ISR_TXE  Transmit Data Register
       *                                 Empty
       * USART_CR1_PEIE   USART_ISR_PE   Parity Error
       *
       * USART_CR2_LBDIE  USART_ISR_LBD  Break Flag             (not used)
       * USART_CR3_EIE    USART_ISR_FE   Framing Error
       * "           "    USART_ISR_NF   Noise Flag
       * "           "    USART_ISR_ORE  Overrun Error Detected
       * USART_CR3_CTSIE  USART_ISR_CTS  CTS flag               (not used)
       */

      cr1 = stm32h5serial_getreg(priv, STM32_USART_CR1_OFFSET);
      cr3 = stm32h5serial_getreg(priv, STM32_USART_CR3_OFFSET);

      /* Return the current interrupt mask value for the used interrupts.
       * Notice that this depends on the fact that none of the used interrupt
       * enable bits overlap.  This logic would fail if we needed the break
       * interrupt!
       */

      *ie = (cr1 & (USART_CR1_USED_INTS)) | (cr3 & USART_CR3_EIE);
    }

  /* Disable all interrupts */

  stm32h5serial_setusartint(priv, 0);

  spin_unlock_irqrestore(NULL, flags);
}

/****************************************************************************
 * Name: stm32h5serial_dmanextrx
 *
 * Description:
 *   Returns the index into the RX FIFO where the DMA will place the next
 *   byte that it receives.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_DMA
static int stm32h5serial_dmanextrx(struct stm32h5_serial_s *priv)
{
  size_t dmaresidual;

  dmaresidual = stm32h5_dmaresidual(priv->rxdma);

  return (RXDMA_BUFFER_SIZE - (int)dmaresidual);
}
#endif

/****************************************************************************
 * Name: stm32h5serial_setformat
 *
 * Description:
 *   Set the serial line format and speed.
 *
 ****************************************************************************/

