stbenn/nuttx/arch/arm/src/stm32h5/stm32h5_serial.c
#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void stm32h5serial_setformat(struct uart_dev_s *dev)
{
  struct stm32h5_serial_s *priv =
    (struct stm32h5_serial_s *)dev->priv;
  uint32_t regval;
  uint32_t brr;
  uint32_t cr1;

  /* This first implementation is for U[S]ARTs that support oversampling
   * by 8 in additional to the standard oversampling by 16.
   */
#ifdef CONFIG_STM32H5_LPUART1
  if (priv->islpuart == true)
    {
      /* LPUART BRR (19:00) = (256*apbclock_hz/baud_rate) */

      uint32_t apbclock_whole = priv->apbclock;
      uint32_t clock_baud_ratio = apbclock_whole / priv->baud;
      uint32_t presc_reg = 0x0;

      /* LPUART PRESC (3:0)
       * Divide the apbclock if necessary for low baud rates
       * 3 * baud_rate <= apbclock_whole <= 4096 * baud_rate
       */

      if (clock_baud_ratio <= 4096)
        {
          presc_reg = 0x0;
        }
      else if (clock_baud_ratio > 4096 && clock_baud_ratio <= 8192)
        {
          presc_reg = 0x1;
          apbclock_whole >>= 1;
        }
      else if (clock_baud_ratio > 8192 && clock_baud_ratio <= 16384)
        {
          presc_reg = 0x2;
          apbclock_whole >>= 2;
        }
      else if (clock_baud_ratio > 16384 && clock_baud_ratio <= 24576)
        {
          presc_reg = 0x3;
          apbclock_whole /= 6;
        }
      else if (clock_baud_ratio > 24576 && clock_baud_ratio <= 32768)
        {
          presc_reg = 0x4;
          apbclock_whole >>= 3;
        }
      else if (clock_baud_ratio > 32768 && clock_baud_ratio <= 40960)
        {
          presc_reg = 0x5;
          apbclock_whole /= 10;
        }
      else if (clock_baud_ratio > 40960 && clock_baud_ratio <= 49152)
        {
          presc_reg = 0x6;
          apbclock_whole /= 12;
        }
      else if (clock_baud_ratio > 32768 && clock_baud_ratio <= 65536)
        {
          presc_reg = 0x7;
          apbclock_whole >>= 4;
        }
      else if (clock_baud_ratio > 65536  && clock_baud_ratio <= 131072)
        {
          presc_reg = 0x8;
          apbclock_whole >>= 5;
        }
      else if (clock_baud_ratio > 131072  && clock_baud_ratio <= 262144)
        {
          presc_reg = 0x9;
          apbclock_whole >>= 6;
        }
      else if (clock_baud_ratio > 262144  && clock_baud_ratio <= 524288)
        {
          presc_reg = 0xa;
          apbclock_whole >>= 7;
        }
      else
        {
          presc_reg = 0xb;
          apbclock_whole >>= 8;
        }

      /* Write the PRESC register */

      up_serialout(priv, STM32_USART_PRESC_OFFSET, presc_reg);

      /* Set the LPUART BRR value after setting Prescaler
       * BRR = ( (256 * apbclock_whole) + baud_rate / 2 ) / baud_rate
       */

      brr = (((uint64_t)apbclock_whole << 8) + (priv->baud >> 1)) / \
               priv->baud;
    }
  else
#endif /* CONFIG_STM32H5_LPUART1 */
    {
      uint32_t usartdiv8;

      /* In case of oversampling by 8, the equation is:
       *
       *   baud      = 2 * fCK / usartdiv8
       *   usartdiv8 = 2 * fCK / baud
       */

      usartdiv8 = ((priv->apbclock << 1) + (priv->baud >> 1)) / priv->baud;

      /* Baud rate for standard USART (SPI mode included):
       *
       * In case of oversampling by 16, the equation is:
       *   baud       = fCK / usartdiv16
       *   usartdiv16 = fCK / baud
       *              = 2 * usartdiv8
       */

      /* Use oversamply by 8 only if divisor is small. But what is small? */

      cr1 = stm32h5serial_getreg(priv, STM32_USART_CR1_OFFSET);
      if (usartdiv8 > 2000)
        {
          /* Use usartdiv16 */

          brr  = (usartdiv8 + 1) >> 1;

          /* Clear oversampling by 8 to enable oversampling by 16 */

          cr1 &= ~USART_CR1_OVER8;
        }
      else
        {
          DEBUGASSERT(usartdiv8 >= 8);

          /* Perform mysterious operations on bits 0-3 */

          brr  = ((usartdiv8 & 0xfff0) | ((usartdiv8 & 0x000f) >> 1));

          /* Set oversampling by 8 */

          cr1 |= USART_CR1_OVER8;
        }
    }

  stm32h5serial_putreg(priv, STM32_USART_CR1_OFFSET, cr1);
  stm32h5serial_putreg(priv, STM32_USART_BRR_OFFSET, brr);

  /* Configure parity mode */

  regval  = stm32h5serial_getreg(priv, STM32_USART_CR1_OFFSET);
  regval &= ~(USART_CR1_PCE | USART_CR1_PS | USART_CR1_M0 | USART_CR1_M1);

  if (priv->parity == 1)       /* Odd parity */
    {
      regval |= (USART_CR1_PCE | USART_CR1_PS);
    }
  else if (priv->parity == 2)  /* Even parity */
    {
      regval |= USART_CR1_PCE;
    }

  /* Configure word length (parity uses one of configured bits)
   *
   * Default: 1 start, 8 data (no parity), n stop, OR
   *          1 start, 7 data + parity, n stop
   */

  if (priv->bits == 9 || (priv->bits == 8 && priv->parity != 0))
    {
      /* Select: 1 start, 8 data + parity, n stop, OR
       *         1 start, 9 data (no parity), n stop.
       */

      regval |= USART_CR1_M0;
    }
  else if (priv->bits == 7 && priv->parity == 0)
    {
      /* Select: 1 start, 7 data (no parity), n stop, OR
       */

      regval |= USART_CR1_M1;
    }

  /* Else Select: 1 start, 7 data + parity, n stop, OR
   *              1 start, 8 data (no parity), n stop.
   */

  stm32h5serial_putreg(priv, STM32_USART_CR1_OFFSET, regval);

  /* Configure STOP bits */

  regval = stm32h5serial_getreg(priv, STM32_USART_CR2_OFFSET);
  regval &= ~(USART_CR2_STOP_MASK);

  if (priv->stopbits2)
    {
      regval |= USART_CR2_STOP2;
    }

  stm32h5serial_putreg(priv, STM32_USART_CR2_OFFSET, regval);

  /* Configure hardware flow control */

  regval  = stm32h5serial_getreg(priv, STM32_USART_CR3_OFFSET);
  regval &= ~(USART_CR3_CTSE | USART_CR3_RTSE);

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && !defined(CONFIG_STM32H5_FLOWCONTROL_BROKEN)
  if (priv->iflow && (priv->rts_gpio != 0))
    {
      regval |= USART_CR3_RTSE;
    }
#endif

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->oflow && (priv->cts_gpio != 0))
    {
      regval |= USART_CR3_CTSE;
    }
#endif

  stm32h5serial_putreg(priv, STM32_USART_CR3_OFFSET, regval);
}
#endif /* CONFIG_SUPPRESS_UART_CONFIG */

/****************************************************************************
 * Name: stm32h5serial_setsuspend
 *
 * Description:
 *   Suspend or resume serial peripheral.
 *
 ****************************************************************************/

