stbenn/nuttx/arch/arm/src/stm32h5/stm32h5_serial.c
#ifdef CONFIG_PM
static void stm32h5serial_setsuspend(struct uart_dev_s *dev, bool suspend)
{
  struct stm32h5_serial_s *priv = (struct stm32h5_serial_s *)dev->priv;
#ifdef SERIAL_HAVE_DMA
  bool dmarestored = false;
#endif

  if (priv->suspended == suspend)
    {
      return;
    }

  priv->suspended = suspend;

  if (suspend)
    {
#ifdef CONFIG_SERIAL_IFLOWCONTROL
      if (priv->iflow)
        {
          /* Force RTS high to prevent further Rx. */

          stm32h5_configgpio((priv->rts_gpio & ~GPIO_MODE_MASK)
                             | (GPIO_OUTPUT | GPIO_OUTPUT_SET));
        }
#endif

      /* Disable interrupts to prevent Tx. */

      stm32h5serial_disableusartint(priv, &priv->suspended_ie);

      /* Wait last Tx to complete. */

      while ((stm32h5serial_getreg(priv, STM32_USART_ISR_OFFSET) &
              USART_ISR_TC) == 0);

#ifdef SERIAL_HAVE_DMA
      if (priv->dev.ops == &g_uart_dma_ops && !priv->rxdmasusp)
        {
#ifdef CONFIG_SERIAL_IFLOWCONTROL
          if (priv->iflow && priv->rxdmanext == RXDMA_BUFFER_SIZE)
            {
              /* Rx DMA in non-circular iflow mode and already stopped
               * at end of DMA buffer. No need to suspend.
               */
            }
          else
#endif
            {
              /* Suspend Rx DMA. */

              stm32h5_dmastop(priv->rxdma);
              priv->rxdmasusp = true;
            }
        }
#endif
    }
  else
    {
#ifdef SERIAL_HAVE_DMA
      if (priv->dev.ops == &g_uart_dma_ops && priv->rxdmasusp)
        {
#ifdef CONFIG_SERIAL_IFLOWCONTROL
          if (priv->iflow)
            {
              stm32h5serial_dmaiflowrestart(priv);
            }
          else
#endif
            {
              /* This USART does not have HW flow-control. Unconditionally
               * re-enable DMA (might loss unprocessed bytes received
               * to DMA buffer before suspending).
               */

              stm32h5serial_dmareenable(priv);
              priv->rxdmasusp = false;
            }

          dmarestored = true;
        }
#endif

      /* Re-enable interrupts to resume Tx. */

      stm32h5serial_restoreusartint(priv, priv->suspended_ie);

#ifdef CONFIG_SERIAL_IFLOWCONTROL
      if (priv->iflow)
        {
          /* Restore peripheral RTS control. */

          stm32h5_configgpio(priv->rts_gpio);
        }
#endif
    }

#ifdef SERIAL_HAVE_DMA
  if (dmarestored)
    {
      irqstate_t flags;

      flags = enter_critical_section();

      /* Perform initial Rx DMA buffer fetch to wake-up serial device
       * activity.
       */

      if (priv->rxdma != NULL)
        {
          stm32h5serial_dmarxcallback(priv->rxdma, 0, priv);
        }

      leave_critical_section(flags);
    }
#endif
}
#endif

/****************************************************************************
 * Name: stm32h5serial_pm_setsuspend
 *
 * Description:
 *   Suspend or resume serial peripherals for/from deep-sleep/stop modes.
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static void stm32h5serial_pm_setsuspend(bool suspend)
{
  int n;

  /* Already in desired state? */

  if (suspend == g_serialpm.serial_suspended)
    return;

  g_serialpm.serial_suspended = suspend;

  for (n = 0; n < STM32H5_NLPUART + STM32H5_NUSART + STM32H5_NUART; n++)
    {
      struct stm32h5_serial_s *priv = g_uart_devs[n];

      if (!priv || !priv->initialized)
        {
          continue;
        }

      stm32h5serial_setsuspend(&priv->dev, suspend);
    }
}
#endif

/****************************************************************************
 * Name: stm32h5serial_setapbclock
 *
 * Description:
 *   Enable or disable APB clock for the USART peripheral
 *
 * Input Parameters:
 *   dev - A reference to the UART driver state structure
 *   on  - Enable clock if 'on' is 'true' and disable if 'false'
 *
 ****************************************************************************/

static void stm32h5serial_setapbclock(struct uart_dev_s *dev, bool on)
{
  struct stm32h5_serial_s *priv =
    (struct stm32h5_serial_s *)dev->priv;
  uint32_t rcc_en;
  uint32_t regaddr;

  /* Determine which USART to configure */

  switch (priv->usartbase)
    {
    default:
      return;
#ifdef CONFIG_STM32H5_LPUART1_SERIALDRIVER
    case STM32_LPUART1_BASE:
      rcc_en = RCC_APB3ENR_LPUART1EN ;
      regaddr = STM32_RCC_APB3ENR;
      break;
#endif
#ifdef CONFIG_STM32H5_USART1_SERIALDRIVER
    case STM32_USART1_BASE:
      rcc_en = RCC_APB2ENR_USART1EN ;
      regaddr = STM32_RCC_APB2ENR;
      break;
#endif
#ifdef CONFIG_STM32H5_USART2_SERIALDRIVER
    case STM32_USART2_BASE:
      rcc_en = RCC_APB1LENR_USART2EN;
      regaddr = STM32_RCC_APB1LENR;
      break;
#endif
#ifdef CONFIG_STM32H5_USART3_SERIALDRIVER
    case STM32_USART3_BASE:
      rcc_en = RCC_APB1LENR_USART3EN;
      regaddr = STM32_RCC_APB1LENR;
      break;
#endif
#ifdef CONFIG_STM32H5_UART4_SERIALDRIVER
    case STM32_UART4_BASE:
      rcc_en = RCC_APB1LENR_UART4EN;
      regaddr = STM32_RCC_APB1LENR;
      break;
#endif
#ifdef CONFIG_STM32H5_UART5_SERIALDRIVER
    case STM32_UART5_BASE:
      rcc_en = RCC_APB1LENR_UART5EN;
      regaddr = STM32_RCC_APB1LENR;
      break;
#endif
#ifdef CONFIG_STM32H5_USART6_SERIALDRIVER
    case STM32_USART6_BASE:
      rcc_en = RCC_APB1LENR_USART6EN;
      regaddr = STM32_RCC_APB1LENR;
      break;
#endif
#ifdef CONFIG_STM32H5_UART7_SERIALDRIVER
    case STM32_UART7_BASE:
      rcc_en = RCC_APB1LENR_UART7EN;
      regaddr = STM32_RCC_APB1LENR;
      break;
#endif
#ifdef CONFIG_STM32H5_UART8_SERIALDRIVER
    case STM32_UART8_BASE:
      rcc_en = RCC_APB1LENR_UART8EN;
      regaddr = STM32_RCC_APB1LENR;
      break;
#endif
#ifdef CONFIG_STM32H5_UART9_SERIALDRIVER
    case STM32_UART9_BASE:
      rcc_en = RCC_APB1HENR_UART9EN;
      regaddr = STM32_RCC_APB1HENR;
      break;
#endif

#ifdef CONFIG_STM32H5_USART10_SERIALDRIVER
    case STM32_USART10_BASE:
      rcc_en = RCC_APB1LENR_USART10EN;
      regaddr = STM32_RCC_APB1LENR;
      break;
#endif
#ifdef CONFIG_STM32H5_USART11_SERIALDRIVER
    case STM32_USART11_BASE:
      rcc_en = RCC_APB1LENR_USART11EN;
      regaddr = STM32_RCC_APB1LENR;
      break;
#endif
#ifdef CONFIG_STM32H5_UART12_SERIALDRIVER
    case STM32_UART12_BASE:
      rcc_en = RCC_APB1HENR_UART12EN;
      regaddr = STM32_RCC_APB1HENR;
      break;
#endif
    }

  /* Enable/disable APB 1/2 clock for USART */

  if (on)
    {
      modifyreg32(regaddr, 0, rcc_en);
    }
  else
    {
      modifyreg32(regaddr, rcc_en, 0);
    }
}

/****************************************************************************
 * Name: stm32h5serial_setup
 *
 * Description:
 *   Configure the USART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

static int stm32h5serial_setup(struct uart_dev_s *dev)
{
  struct stm32h5_serial_s *priv =
    (struct stm32h5_serial_s *)dev->priv;

